src/Documents/СК_Корректировка/СК_Корректировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СК_Корректировка</name>
  <registerRecords>AccumulationRegister.СК_ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>ВидДвижения</name>
    <type>
      <types>EnumRef.ВидыДвиженияНакопления</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СК_Ячейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидыДвиженияНакопления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/СК_Инвентаризация/СК_Инвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СК_Инвентаризация</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СК_Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПересчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/СК_Корректировка/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоИнвентаризацииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_Инвентаризация.Количество КАК Количество,
	               |	СК_Инвентаризация.Номенклатура КАК Номенклатура,
	               |	СК_Инвентаризация.Ячейка КАК Ячейка,
	               |	ВложенныйЗапрос.ВналичииОстаток КАК ВналичииОстаток
	               |ИЗ
	               |	РегистрСведений.СК_Инвентаризация КАК СК_Инвентаризация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |			СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
	               |			СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	               |		ИЗ
	               |			РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки) КАК ВложенныйЗапрос
	               |		ПО СК_Инвентаризация.Номенклатура = ВложенныйЗапрос.Номенклатура
	               |			И СК_Инвентаризация.Ячейка = ВложенныйЗапрос.Ячейка";
	Рез = Запрос.Выполнить().Выгрузить();
	Для Каждого стр из Рез Цикл
		Если стр.ВналичииОстаток = Null Тогда
			Т = Объект.Товары.Добавить();
			Т.Номенклатура = стр.Номенклатура;
			Т.Количество = стр.Количество;
			Т.Ячейка = стр.Ячейка;
			Т.ВидДвижения = Перечисления.ВидыДвиженияНакопления.Приход;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИнвентаризации(Команда)
	ЗаполнитьПоИнвентаризацииНаСервере();
КонецПроцедуры
